---
kind: property
id: P:Autodesk.Revit.DB.Visual.Marble.MarbleWidth
source: html/3794da51-48c5-5fad-b770-e76a4abe7003.htm
---
# Autodesk.Revit.DB.Visual.Marble.MarbleWidth Property

The property labeled "Vein Width" from the "Marble" schema.

## Syntax (C#)
```csharp
public static string MarbleWidth { get; }
```

## Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 1".